src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СК_Ячейки/Forms/ФормаЯчеек/Module.bsl
&НаСервере
Процедура СоздатьЯчейкиНаСервере()
	Склад = ЭтаФорма.Склад;
	Сеция = ЭтаФорма.Секция;
	Ряд = ЭтаФорма.Ряд;
	ЯчейкаОт = ЭтаФорма.ЯчейкаОт;
	ЯчейкаДо = ЭтаФорма.ЯчейкаДо;
	К = ЯчейкаДо-ЯчейкаОт;
	
	Для сч=0 По К Цикл  
		Ячейка = ЯчейкаОт+сч;
		//@skip-check query-in-loop
		Если НайтиЯчейку(Секция,Ряд,Ячейка,Склад) = 0 Тогда
			спр = Справочники.СК_Ячейки.СоздатьЭлемент();
			спр.Наименование = "Секция " + Строка(Секция) + " / Ряд " + Строка(Ряд) + " / Ячейка " + Строка(Ячейка) ;
			спр.Склад = Склад;
			спр.Ряд = Ряд;
			спр.Секция = Секция;
			спр.Ячейка = Ячейка;
			спр.Записать();
			НСпр = спр.Ссылка.ПолучитьОбъект(); 
			НСпр.ШтрихКод = СформироватьШтрихкодEAN13(НСпр);
			НСпр.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	
	
КонецПроцедуры

&НаСервере
Функция НайтиЯчейку(Секция,Ряд,Ячейка,Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.Ряд = &Ряд
	               |	И СК_Ячейки.Секция = &Секция
	               |	И СК_Ячейки.Склад = &Склад
	               |	И СК_Ячейки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Ряд",Ряд);
	Запрос.УстановитьПараметр("Секция",Секция);
	Запрос.УстановитьПараметр("Ячейка",Ячейка); 
	Рез = Запрос.Выполнить().Выбрать();
	
	Возврат Рез.Количество();
	
КонецФункции



&НаКлиенте
Процедура СоздатьЯчейки(Команда)  
	Ош = ПроверитьПоля();
	Если Ош = Истина Тогда
		СоздатьЯчейкиНаСервере();
		ЭтаФорма.Закрыть();
	Иначе
		Сообщить(Ош);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоля()
	Ош = Истина;

	Если ЭтаФорма.Склад = Справочники.Склады.ПустаяСсылка() Тогда
		Возврат "Заполните Склад"; 
	КонецЕсли;	

	
	Если СтрДлина(ЭтаФорма.Секция) < 1 Тогда
		Возврат "Заполните секцию"; 
	КонецЕсли;	
	
	Если СтрДлина(ЭтаФорма.Ряд) < 1 Тогда 
		Возврат "Заполните Ряд";
	КонецЕсли;	
	
	Если ЭтаФорма.ЯчейкаОт > ЭтаФорма.ЯчейкаДо Тогда
		Возврат "Укажите корректный интервал ячеек";
	КонецЕсли;  
	
	//Если ЭтаФорма.ЯчейкаОт = 0 Тогда
	//	Возврат  "Заполните ячейку от";
	//КонецЕсли;
	Если ЭтаФорма.ЯчейкаДо = 0 Тогда 
		
		Возврат  "Заполните ячейку до";
	КонецЕсли;
	
	
	Возврат Ош;
	
КонецФункции

///////////////////////
Функция СформироватьШтрихкодEAN13(Ссылка) Экспорт

	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Ссылка.Код, Ссылка.Код, ПрефиксУзлаШтрихкода);

КонецФункции


Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт

	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции   

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции  

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции
